SunCity/src/Documents/ВводНачальныхОстатковУзла/ВводНачальныхОстатковУзла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковУзла</name>
  <registerRecords>InformationRegister.СебестоимостьНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыТоваров</registerRecords>
  <registerRecords>InformationRegister.ДействующиеЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваБезналичные</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваККМ</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.АвтономнаяРабота</types>
      <types>ExchangePlanRef.ОбменРозницаРозница</types>
      <types>ExchangePlanRef.ПоМагазину</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействующиеЦеныНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваККМ</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваБезналичные</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьБанковскийСчет</name>
      <type>
        <types>CatalogRef.УдалитьБанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваНаличные</name>
    <attributes>
      <name>Касса</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СебестоимостьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыКПоступлению</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаСкладах</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыОрганизаций</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныНоменклатуры</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыКОтгрузке</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SunCity/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентСтоимостиРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SunCity/src/AccumulationRegisters/ТоварыКПоступлению/ТоварыКПоступлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКПоступлению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ВводНачальныхОстатковУзла</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SunCity/src/Documents/ВводНачальныхОстатковУзла/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет табличные части на наличие строк.
//
// Возвращаемое значение:
//  Булево - признак проверки документа на пустоту.
//
Функция Пустой() Экспорт
	
	Результат = Истина;
	
	Для Каждого ТаблЧасть Из Метаданные().ТабличныеЧасти Цикл
	
		Если ЭтотОбъект[ТаблЧасть.Имя].Количество() > 0 Тогда
			Результат = Ложь;
			Прервать
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.ПоМагазину.НайтиПоКоду(КодУзлаОбмена);
	Если НЕ УзелОбмена.Пустая() Тогда
		
		Узел = УзелОбмена;
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
			
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ВводНачальныхОстатковУзла.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьДвиженияСебестоимостьНоменклатуры(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваККМ(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваНаличные(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваБезналичные(ДополнительныеСвойства, Движения, Отказ);
	Ценообразование.ОтразитьЦеныНоменклатуры(ДополнительныеСвойства, Движения, Отказ);
	Ценообразование.ОтразитьПрименениеЦенНоменклатуры(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	УдалитьРегистрацию();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьРегистрацию()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоМагазину.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ПоМагазину КАК ПоМагазину
	|ГДЕ
	|	НЕ ПоМагазину.ЭтотУзел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбменРозницаРозница.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменРозницаРозница КАК ОбменРозницаРозница
	|ГДЕ
	|	НЕ ОбменРозницаРозница.ЭтотУзел");
	
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если Документы.ВводНачальныхОстатковУзла.ВозможноПровестиВводОстатковВУзле(Узел) Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, Ссылка);
		
	КонецЕсли;
	
	НаборТоварыНаСкладах = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
	НаборТоварыНаСкладах.Отбор.Регистратор.Установить(Ссылка);
	НаборТоварыНаСкладах.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборТоварыНаСкладах);
	
	НаборТоварыОрганизаций = РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
	НаборТоварыОрганизаций.Отбор.Регистратор.Установить(Ссылка);
	НаборТоварыОрганизаций.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборТоварыОрганизаций);
	
	НаборДенежныеСредстваНаличные = РегистрыНакопления.ДенежныеСредстваНаличные.СоздатьНаборЗаписей();
	НаборДенежныеСредстваНаличные.Отбор.Регистратор.Установить(Ссылка);
	НаборДенежныеСредстваНаличные.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборДенежныеСредстваНаличные);
	
	НаборДенежныеСредстваККМ = РегистрыНакопления.ДенежныеСредстваККМ.СоздатьНаборЗаписей();
	НаборДенежныеСредстваККМ.Отбор.Регистратор.Установить(Ссылка);
	НаборДенежныеСредстваККМ.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборДенежныеСредстваККМ);
	
	НаборЦеныНоменклатуры = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЦеныНоменклатуры.Отбор.Регистратор.Установить(Ссылка);
	НаборЦеныНоменклатуры.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборЦеныНоменклатуры);
	
	НаборДействующиеЦеныНоменклатуры = РегистрыСведений.ДействующиеЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборДействующиеЦеныНоменклатуры.Отбор.Регистратор.Установить(Ссылка);
	НаборДействующиеЦеныНоменклатуры.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборДействующиеЦеныНоменклатуры);
	
	НаборСебестоимостьНоменклатуры = РегистрыСведений.СебестоимостьНоменклатуры.СоздатьНаборЗаписей();
	НаборСебестоимостьНоменклатуры.Отбор.Регистратор.Установить(Ссылка);
	НаборСебестоимостьНоменклатуры.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборСебестоимостьНоменклатуры);

	НаборТоварыКПоступлению = РегистрыНакопления.ТоварыКПоступлению.СоздатьНаборЗаписей();
	НаборТоварыКПоступлению.Отбор.Регистратор.Установить(Ссылка);
	НаборТоварыКПоступлению.Прочитать();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, НаборТоварыКПоступлению);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
